# Test timeportal resolution
read_verilog << EOF
module top(clk, rst, ai, ao, bi, bo);
  input clk;
  input rst;
  input [7:0] ai;
  input [5:0] bi;
  output [7:0] ao;
  output [5:0] bo;
  wire [7:0] a3;
  wire [5:0] b3;
  TIMEPORTAL #(
  	.A_WIDTH(8),
    .B_WIDTH(6)
  ) tp1(.A(a3), .AY(ao), .B(bi), .BY(b3));
  SEER #(
  	.WIDTH(8),
  	.OFFSET(-3)
  ) s1(.A(ai), .Y(a3));
  SEER #(
    .WIDTH(6),
    .OFFSET(3)
  ) s2(.A(b3), .Y(bo));
endmodule
EOF

portal_check
fold_synth -no_lower
clean -purge
select -assert-none t:SEER
timeportal_drop
select -assert-none t:TIMEPORTAL

sat -prove bo bi -verify
